# 3. Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.

# *Пример:*
# - Для n = 6: [2.0, 2.25, 2.37037037037037, 2.44140625, 2.4883199999999994, 2.5216263717421135]


# Вариант 1
from msilib import sequence

i = int(input('Введите число: ')) 

def seq(i):
    return [round((1 + 1 / x)**x, 12) for x in range (1, i + 1)]

nums = seq(i)
print(nums)


